# Pandas Tutorial

**Create Data** - We begin by creating our own data set for analysis. This prevents the end user reading this tutorial from having to download any files to replicate the results below. We will export this data set to a text file so that you can get some experience pulling data from a text file.  
**Get Data** - We will learn how to read in the text file. The data consist of baby names and the number of baby names born in the year 1880.  
**Prepare Data** - Here we will simply take a look at the data and make sure it is clean. By clean I mean we will take a look inside the contents of the text file and look for any anomalities. These can include missing data, inconsistencies in the data, or any other data that seems out of place. If any are found we will then have to make decisions on what to do with these records.  
**Analyze Data** - We will simply find the most popular name in a specific year.  
**Present Data** - Through tabular data and a graph, clearly show the end user what is the most popular name in a specific year.

> The ***pandas*** library is used for all the data analysis excluding a small piece of the data presentation section. The ***matplotlib*** library will only be needed for the data presentation section. Importing the libraries is the first step we will take in the lesson.

In [1]:
# Import all libraries needed for the tutorial

# General syntax to import specific functions in a library: 
##from (library) import (specific library function)
from pandas import DataFrame, read_csv

# General syntax to import a library but no functions: 
##import (library) as (give the library a nickname/alias)
import matplotlib.pyplot as plt
import pandas as pd #this is how I usually import pandas
import sys #only needed to determine Python version number
import matplotlib #only needed to determine Matplotlib version number

# Enable inline plotting
%matplotlib inline

In [2]:
print('Python version ' + sys.version)
print('Pandas version ' + pd.__version__)
print('Matplotlib version ' + matplotlib.__version__)

Python version 3.8.8 (default, Apr 13 2021, 15:08:03) [MSC v.1916 64 bit (AMD64)]
Pandas version 1.2.4
Matplotlib version 3.3.4

# Create Data  

The data set will consist of 5 baby names and the number of births recorded for that year (1880).

In [3]:
# The inital set of baby names and bith rates
names = ['Bhrama','Jerry','Monika','Jinesh','Mushef']
births = [968, 155, 77, 578, 973]

To merge these two lists together we will use the ***zip*** function.

In [4]:
zip?

In [5]:
BabyDataSet = list(zip(names,births))
BabyDataSet

[('Bhrama', 968),
 ('Jerry', 155),
 ('Monika', 77),
 ('Jinesh', 578),
 ('Mushef', 973)]

We are basically done creating the data set. We now will use the ***pandas*** library to export this data set into a csv file. 

***df*** will be a ***DataFrame*** object. You can think of this object holding the contents of the BabyDataSet in a format similar to a sql table or an excel spreadsheet. Lets take a look below at the contents inside ***df***.

In [6]:
df = pd.DataFrame(data = BabyDataSet, columns=['Names', 'Births'])
df

    Names  Births
0  Bhrama     968
1   Jerry     155
2  Monika      77
3  Jinesh     578
4  Mushef     973

Export the dataframe to a ***csv*** file. We can name the file ***births1880.csv***. The function ***to_csv*** will be used to export the file. The file will be saved in the same location of the notebook unless specified otherwise.

In [7]:
df.to_csv?

The only parameters we will use is ***index*** and ***header***. Setting these parameters to False will prevent the index and header names from being exported. Change the values of these parameters to get a better understanding of their use.

In [8]:
df.to_csv('births1880.csv',index=False,header=False)

## Get Data

To pull in the csv file, we will use the pandas function *read_csv*. Let us take a look at this function and what inputs it takes.

In [9]:
read_csv?

Even though this functions has many parameters, we will simply pass it the location of the text file.  

Location =births1880.csv  

***Note:*** Depending on where you save your notebooks, you may need to modify the location above.

In [10]:
Location = r'births1880.csv'
df = pd.read_csv(Location)

Notice the ***r*** before the string. Since the slashes are special characters, prefixing the string with a ***r*** will escape the whole string.

In [11]:
df

   Bhrama  968
0   Jerry  155
1  Monika   77
2  Jinesh  578
3  Mushef  973

This brings us to the first problem of the exercise. The ***read_csv*** function treated the first record in the csv file as the header names. This is obviously not correct since the text file did not provide us with header names.  

To correct this we will pass the ***header*** parameter to the *read_csv* function and set it to ***None*** (means null in python).

In [12]:
df = pd.read_csv(Location, header=None)
df

        0    1
0  Bhrama  968
1   Jerry  155
2  Monika   77
3  Jinesh  578
4  Mushef  973

If we wanted to give the columns specific names, we would have to pass another paramter called ***names***. We can also omit the *header* parameter.

In [13]:
df = pd.read_csv(Location, names=['Names','Births'])
df

    Names  Births
0  Bhrama     968
1   Jerry     155
2  Monika      77
3  Jinesh     578
4  Mushef     973

You can think of the numbers [0,1,2,3,4] as the row numbers in an Excel file. In pandas these are part of the ***index*** of the dataframe. You can think of the index as the primary key of a sql table with the exception that an index is allowed to have duplicates.  

***[Names, Births]*** can be though of as column headers similar to the ones found in an Excel spreadsheet or sql database.

> Delete the csv file now that we are done using it.

In [14]:
import os
os.remove(Location)

## Prepare Data

The data we have consists of baby names and the number of births in the year 1880. We already know that we have 5 records and none of the records are missing (non-null values).

The ***Names*** column at this point is of no concern since it most likely is just composed of alpha numeric strings (baby names). There is a chance of bad data in this column but we will not worry about that at this point of the analysis. The ***Births*** column should just contain integers representing the number of babies born in a specific year with a specific name. We can check if the all the data is of the data type integer. It would not make sense to have this column have a data type of float. I would not worry about any possible outliers at this point of the analysis.  

Realize that aside from the check we did on the "Names" column, briefly looking at the data inside the dataframe should be as far as we need to go at this stage of the game. As we continue in the data analysis life cycle we will have plenty of opportunities to find any issues with the data set.

In [15]:
# Check data type of the columns
df.dtypes

Names     object
Births     int64
dtype: object

In [16]:
# Check data type of Births column
df.Births.dtype

dtype('int64')

As you can see the *Births* column is of type ***int64***, thus no floats (decimal numbers) or alpha numeric characters will be present in this column.

## Analyze Data

To find the most popular name or the baby name with the higest birth rate, we can do one of the following.  

* Sort the dataframe and select the top row
* Use the ***max()*** attribute to find the maximum value

In [17]:
# Method 1:
Sorted = df.sort_values(['Births'], ascending=False)
Sorted.head(1)

    Names  Births
4  Mushef     973

In [18]:
# Method 2:
df['Births'].max()

973

# selection of data

In [19]:
#Returns column with label col as Series
df['Births']

0    968
1    155
2     77
3    578
4    973
Name: Births, dtype: int64

In [20]:
#Returns columns as a new DataFrame
df[['Names', 'Births']]

    Names  Births
0  Bhrama     968
1   Jerry     155
2  Monika      77
3  Jinesh     578
4  Mushef     973

In [21]:
# Selection by position
df.iloc[2:,:]

    Names  Births
2  Monika      77
3  Jinesh     578
4  Mushef     973

In [22]:
#Selection by index
df.loc[1:1]

   Names  Births
1  Jerry     155

In [23]:
# First row
df.iloc[0,:]

Names     Bhrama
Births       968
Name: 0, dtype: object

In [24]:
# First element of first column
df.iloc[0,0]

'Bhrama'

### Data Cleaning

In [25]:
#Rename columns
dc1 = df
dc1.columns = ['Names','Births']
dc1

    Names  Births
0  Bhrama     968
1   Jerry     155
2  Monika      77
3  Jinesh     578
4  Mushef     973

In [26]:
#Checks for null Values, Returns Boolean Arrray
df.isnull()

   Names  Births
0  False   False
1  False   False
2  False   False
3  False   False
4  False   False

In [27]:
# Opposite of ​ pd.isnull()
df.notnull()

   Names  Births
0   True    True
1   True    True
2   True    True
3   True    True
4   True    True

In [28]:
# Drop all rows that contain null values
df.dropna()

    Names  Births
0  Bhrama     968
1   Jerry     155
2  Monika      77
3  Jinesh     578
4  Mushef     973

In [29]:
# Drop all columns that contain null values
df.dropna(axis=1)

    Names  Births
0  Bhrama     968
1   Jerry     155
2  Monika      77
3  Jinesh     578
4  Mushef     973

In [30]:
# Drop all rows have have less than n non null values
df.dropna(axis=1,thresh=5)

    Names  Births
0  Bhrama     968
1   Jerry     155
2  Monika      77
3  Jinesh     578
4  Mushef     973

In [31]:
# Replace all null values with x
df.fillna(3)

    Names  Births
0  Bhrama     968
1   Jerry     155
2  Monika      77
3  Jinesh     578
4  Mushef     973

In [32]:
# Selective renaming
srm = df
srm.rename(columns={'a':'x'})

    Names  Births
0  Bhrama     968
1   Jerry     155
2  Monika      77
3  Jinesh     578
4  Mushef     973

### Filter, Sort & Groupby

In [33]:
# Rows where the column ​ col​ is greater than ​ 900
df[df.Births > 900]

    Names  Births
0  Bhrama     968
4  Mushef     973

In [34]:
# Rows where ​ 1000 > col > 500
df[(df['Births'] > 500)& (df['Births'] < 1000)]

    Names  Births
0  Bhrama     968
3  Jinesh     578
4  Mushef     973

In [35]:
# Sort values by col1 in ascending order
df.sort_values('Births')

    Names  Births
2  Monika      77
1   Jerry     155
3  Jinesh     578
0  Bhrama     968
4  Mushef     973

In [36]:
# Sort values by ​ col2​ in descending order
df.sort_values('Births',ascending=False)

    Names  Births
4  Mushef     973
0  Bhrama     968
3  Jinesh     578
1   Jerry     155
2  Monika      77

In [37]:
# Returns a groupby object for values from one column
#imp link : https://www.geeksforgeeks.org/python-pandas-dataframe-groupby/
df.groupby('Names')

### Join/Combine

In [38]:
# Add the rows in ​ df1​ to the end of ​ df2​ (columns should be identical)
df1 = df
df2 =df
df1.append(df1)

    Names  Births
0  Bhrama     968
1   Jerry     155
2  Monika      77
3  Jinesh     578
4  Mushef     973
0  Bhrama     968
1   Jerry     155
2  Monika      77
3  Jinesh     578
4  Mushef     973

In [39]:
# drop the duplicate values
df2.drop_duplicates()

    Names  Births
0  Bhrama     968
1   Jerry     155
2  Monika      77
3  Jinesh     578
4  Mushef     973

In [40]:
#Important link : https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [41]:
#Add the columns in ​ df1​ to the end of ​ df2​ (rows should be identical)
df3 = df
#df3.concat([df1])
#depricated version

In [42]:
# SQL-style join the columns in ​ df1​ with the columns on df2​ where the rows for ​ col​ have identical values. how
# can be one of ​ 'left'​ , ​ 'right'​ , ​ 'outer'​ , ​ 'inner
#other = pd.DataFrame({'key': ['K0', 'K1', 'K2'],'B': ['B0', 'B1', 'B2']})
df1.join(df2,on='Births',how='inner',lsuffix='_left', rsuffix='_right')

Empty DataFrame
Columns: [Births, Names_left, Births_left, Names_right, Births_right]
Index: []

In [43]:
# SQL-style join the columns in ​ df1​ with the columns on df2​ where the rows for ​ col​ have identical values. how
# can be one of ​ 'left'​ , ​ 'right'​ , ​ 'outer'​ , ​ 'inner
#other = pd.DataFrame({'key': ['K0', 'K1', 'K2'],'B': ['B0', 'B1', 'B2']})
df1.join(df2,on='Births',how='outer',lsuffix='_left', rsuffix='_right')

     Births Names_left  Births_left Names_right  Births_right
0.0     968     Bhrama        968.0         NaN           NaN
1.0     155      Jerry        155.0         NaN           NaN
2.0      77     Monika         77.0         NaN           NaN
3.0     578     Jinesh        578.0         NaN           NaN
4.0     973     Mushef        973.0         NaN           NaN
NaN       0        NaN          NaN      Bhrama         968.0
NaN       1        NaN          NaN       Jerry         155.0
NaN       2        NaN          NaN      Monika          77.0
NaN       3        NaN          NaN      Jinesh         578.0
NaN       4        NaN          NaN      Mushef         973.0

In [45]:
# SQL-style join the columns in ​ df1​ with the columns on df2​ where the rows for ​ col​ have identical values. how
# can be one of ​ 'left'​ , ​ 'right'​ , ​ 'outer'​ , ​ 'inner
#other = pd.DataFrame({'key': ['K0', 'K1', 'K2'],'B': ['B0', 'B1', 'B2']})
df1.join(df2,on='Births',how='left',lsuffix='_left', rsuffix='_right')

  Names_left  Births_left Names_right  Births_right
0     Bhrama          968         NaN           NaN
1      Jerry          155         NaN           NaN
2     Monika           77         NaN           NaN
3     Jinesh          578         NaN           NaN
4     Mushef          973         NaN           NaN

In [49]:
# SQL-style join the columns in ​ df1​ with the columns on df2​ where the rows for ​ col​ have identical values. how
# can be one of ​ 'left'​ , ​ 'right'​ , ​ 'outer'​ , ​ 'inner
#other = pd.DataFrame({'key': ['K0', 'K1', 'K2'],'B': ['B0', 'B1', 'B2']})
df1.join(df2,on='Births',how='right',lsuffix='_left', rsuffix='_right')

     Births Names_left  Births_left Names_right  Births_right
NaN       0        NaN          NaN      Bhrama           968
NaN       1        NaN          NaN       Jerry           155
NaN       2        NaN          NaN      Monika            77
NaN       3        NaN          NaN      Jinesh           578
NaN       4        NaN          NaN      Mushef           973

### Statistics

In [50]:
#Summary statistics for numerical columns
df.describe()

           Births
count    5.000000
mean   550.200000
std    428.424672
min     77.000000
25%    155.000000
50%    578.000000
75%    968.000000
max    973.000000

In [51]:
# Returns the mean of all columns
df.mean()

Births    550.2
dtype: float64

In [52]:
# Returns the correlation between columns in a DataFrame
df.corr()

        Births
Births     1.0

In [53]:
# Returns the number of non-null values in each DataFrame column
df.count()

Names     5
Births    5
dtype: int64

In [54]:
# Returns the highest value in each column
df.max()

Names     Mushef
Births       973
dtype: object

In [55]:
# Returns the lowest value in each column
df.min()

Names     Bhrama
Births        77
dtype: object

In [56]:
# Returns the median of each column
df.median()

Births    578.0
dtype: float64

In [57]:
# Returns the standard deviation of each column
df.std()

Births    428.424672
dtype: float64

<img src='https://softvan.in/wp-content/uploads/2019/01/Softvan-Logo-164px.png' align="left"></img><br><br><br><br><p class="text-muted">This tutorial is created by <a href="http://www.softvan.in" target="_blank"><strong>Vishal Modi - Axisray</strong></a></p>